app/views/home/index.html.erb


        <% category.tasks.each do |task|  %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1  [["category_id", 1]]